---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.HasPlane
source: html/69c92503-2025-ddab-ba91-3085aa2e8117.htm
---
# Autodesk.Revit.DB.CurveLoop.HasPlane Method

Identifies if the CurveLoop is planar.

## Syntax (C#)
```csharp
public bool HasPlane()
```

## Returns
True if the curve loop is planar, false otherwise.